{
    "legal_name": "DALIA HOMECARE VALENCIA",
    "facility_status": "Active",
    "address": "4437 West Valencia Drive, Laveen, AZ 85339",
    "license_status": "Active",
    "phone": "6027572927",
    "license_number": "BH10297",
    "max_licensed_capacity": "5",
    "license_effective_date": "10/25/2024",
    "chief_administrative_officer": "DARIUS COX",
    "license_expires_date": "10/24/2025",
    "owner_licensee": "DALIA HOMECARE, LLC",
    "inspection_number": "INSP-0096914",
    "inspection_date": "2/12/2025",
    "inspection_type": "Initial Monitoring",
    "certificate_number": "BH10297",
    "deficiencies": [
        {
            "rule": "R9-10-706.K.3.a. Personnel K. An administrator shall ensure that: 3. There is a daily staffing schedule that: a. Indicates the date, scheduled work hours, and name of each employee assigned to work, including on-call personnel members;",
            "evidence": "Based on documentation review and interview, an administrator failed to ensure there was a daily staffing schedule. The deficient practice posed a risk as there was no staffing schedule to accurately reflect staff present at the facility or on-call personnel members.",
            "findings": "1. The Compliance Officer requested to review the facility's staffing schedule. However, a staffing schedule was not available for review. 2. In an interview, E1 reported there was no daily staffing schedule, as the facility has only one resident. E1 reported E1 worked at the facility alone every day throughout the week. E1 reported E1 slept while R1 went to school during the day, and E1 called in the on-call staff if E1 felt E1 needed more rest. Plan of Correction Name, title and/or Position of the Person Responsible Darius Cox Date temporary correction was implemented 2025-03-15 Date permanent correction will be complete 2025-03-28 Temporary Solution • Immediately following the survey, Sekou Jackson, Administrator, reviewed the staffing schedule, printed and put on display in the group home. Permanent Solution Sekou Jackson, Administrator, has updated and displayed the daily staffing schedule in facility. Additionally, he will check monthly that the schedule has been updated. Monitoring Sekou Jackson, Administrator, will conduct monthly audits of the daily staffing schedule to ensure that it is accurate and up to date."
        }
    ]
}