{
    "legal_name": "LWB WINTHROP HOUSE",
    "facility_status": "Active",
    "address": "908 North Winthrop Circle, Mesa, AZ 85213",
    "license_status": "Active",
    "phone": "(480)708-1187",
    "license_number": "BH10232",
    "max_licensed_capacity": "10",
    "license_effective_date": "11/12/2024",
    "chief_administrative_officer": "Jocelyn Negron",
    "license_expires_date": "11/11/2025",
    "owner_licensee": "LIV WELL BEHAVIORAL",
    "inspection_number": "INSP-0134809",
    "inspection_date": "6/26/2025",
    "inspection_type": "Compliance (Annual)",
    "certificate_number": "BH10232",
    "deficiencies": [
        {
            "rule": "A.R.S. § 36-425.03.A. Children's behavioral health programs; personnel; fingerprinting requirements; exemptions; definitions A. Except as provided in subsections B, C and D of this section, children's behavioral health program personnel, including volunteers, shall submit the form prescribed in subsection E of this section to the employer and shall have a valid fingerprint clearance card issued pursuant to title 41, chapter 12, article 3.1 or, within seven working days after employment or beginning volunteer work, shall apply for a fingerprint clearance card.",
            "evidence": "Based on documentation review, record review and interview, the health care institution failed to ensure compliance with A.R.S. § 36- 425.03.A. The deficient practice posed a risk if E1 was a danger to a vulnerable population.",
            "findings": "1. A review of E1's personnel record revealed E1's fingerprint card \"Expiration Date\" was June 19, 2025. 2. A review of the psp.azdps.gov website (Arizo na's Department of Public Safety (DPS) fingerp rint verification website) revealed E1's \"Level 1 \" fingerprint clearance card was listed as \"Not Valid\" and expired in June 2025. 3. A review of R1's, R2's, and R3's medical records revealed all residents were under 18 years of age. 4. In an interview, E1 reported being unaware E1's fingerprint clearance card was listed as \"Not Valid\" according to the DPS website. 5. In an exit interview, E1 reported E1 will start E1's fingerprint clearance application on the upcoming weekend, and no other statements were provided. 6. As of July 7, 2025, E1's did not have a valid fingerprint clearance card per the DPS fingerprint verification website Plan of Correction Name, title and/or Position of the Person Responsible Megan Morris, Director of Growth and Development and Compliance Officer Date temporary correction was implemented 2025-07-09 Date permanent correction will be complete 2025-07-28 Temporary Solution E1 completed and submitted application to DPS for renewal of Fingerprint Clearance Card on afternoon of 6/27/2025. The Fingerprint Clearance Card application was processed and became active in the system on approximately 7/9/2025 and the hard copy of the FCC has since been obtained. Permanent Solution In response to the violation of A.R.S. § 36- 425.03.A, Liv Well Behavioral has enacted the following Corrective Action Plan. Employee responsible for oversight of personnel files received individual corrective action and, as a part of that plan, the Executive Team has implemented ongoing weekly meetings with the Human Resources Coordinator to provide increased accountability. The Compliance Officer and Training Coordinator have begun meeting weekly with the Human Resources Coordinator to ensure compliance and enforce standards outlined within A.R.S. § 36-425.03.A and the AZ Administrative Code prior to employees beginning on-site orientation process. The Training Coordinator has established an ongoing bi-weekly orientation schedule to provide the Human Resources Coordinator with increased clarity on start dates and improved planning for orientation to begin. The Compliance Officer has increased the frequency of internal personnel file audits from quarterly to monthly. The Chief of Staff is assisting the Human Resources Department with improving tracking systems and methods to ensure ongoing compliance with all personnel file requirements for existing and new employees. Monitoring Ongoing monitoring to ensure compliance with A.R.S. § 36-425.03.A will be the responsibility of the Liv Well Behavioral Executive Team and Compliance Officer."
        }
    ]
}