{
    "legal_name": "MS MIMI CARING HEART LLC",
    "facility_status": "Active",
    "address": "3466 West Sunshine Butte Drive, Queen Creek, AZ 85142",
    "license_status": "Active",
    "phone": "6026160039",
    "license_number": "BH10227",
    "max_licensed_capacity": "5",
    "license_effective_date": "11/20/2024",
    "chief_administrative_officer": "MIRLANDE BONNE-ANNE",
    "license_expires_date": "11/19/2025",
    "owner_licensee": "MS. MINI CARING HEART LLC",
    "inspection_number": "INSP-0078185",
    "inspection_date": "1/28/2025",
    "inspection_type": "Initial Monitoring",
    "certificate_number": "BH10227",
    "deficiencies": [
        {
            "rule": "A.R.S.§ 36-411. Residential care institutions; nursing care institutions; home health agencies; fingerprinting requirements; exemptions; definitions A. Except as provided in subsection F of this section, as a condition of licensure or continued licensure of a residential care institution, a nursing care institution or a home health agency and as a condition of employment in a residential care institution, a nursing care institution or a home health agency, employees and owners of residential care institutions, nursing care institutions or home health agencies, contracted persons of residential care institutions, nursing care institutions or home health agencies or volunteers of residential care institutions, nursing care institutions or home health agencies who provide medical services, nursing services, behavioral health services, health-related services, home health services or direct supportive services and who have not been subject to the fingerprinting requirements of a health professional's regulatory board pursuant to title 32 shall have valid fingerprint clearance cards that are issued pursuant to title 41, chapter 12, article 3.1 or shall apply for a fingerprint clearance card within twenty working days of employment or beginning volunteer work or contracted work.",
            "evidence": "Based on documentation review, record review, and interview, the governing authority failed to ensure compliance with Arizona Revised Statutes (A.R.S.) \\'a7 36-411(A), for two of five employees sampled. The deficient practice posed a risk if E2 was a danger to a vulnerable population.",
            "findings": "A.R.S. \\'a7 36-411(A) states, \"A. Except as provided in subsection F of this section, as a condition of licensure or continued licensure of a residential care institution, a nursing care institution or a home health agency and as a condition of employment in a residential care institution, a nursing care institution or a home health agency, employees and owners of residential care institutions, nursing care institutions or home health agencies or contracted persons or volunteers who provide medical services, nursing services, behavioral health services, health-related services, home health services or supportive services and who have not been subject to the fingerprinting requirements of a health professional's regulatory board pursuant to title 32 shall have valid fingerprint clearance cards that are issued pursuant to title 41, chapter 12, article 3.1 or shall apply for a fingerprint clearance card within twenty working days of employment or beginning volunteer work or contracted work.\" 1. A review of facility documentation revealed a policy titled, \"Employees and Volunteers Qualifications.\" The policy stated, \"... 3. Fingerprinting requirements as specified in A.R.S. \\'a7 36-411. As a condition of employment or volunteer services, the individual shall have valid fingerprint clearance card or shall apply for a fingerprint clearance card within 20 working days of employment or beginning volunteer services, as well shall present criminal history affidavit notarized before or on the starting day of employment...\" 2. A review of E2's personnel record revealed a fingerprint clearance card expired in November 2024. However, documentation of a current fingerprint clearance card was not available for review. 3. A review of E5's personnel record revealed documentation of a fingerprint clearance card was not available for review. 4. In an interview, E2 reported E2 was unaware the fingerprint clearance card expired. 5. In an interview, E1 reported E5 has the fingerprint clearance card but cannot find the documentation. 6. In an exit interview, E1 and E2 reviewed the findings and not additional documentation was provided. Plan of Correction Name, title and/or Position of the Person Responsible Date temporary correction was implemented Date permanent correction will be complete Temporary Solution Permanent Solution Monitoring"
        },
        {
            "rule": "A.R.S. § 36-411. Residential care institutions; nursing care institutions; home health agencies; fingerprinting requirements; exemptions; definitions C. Owners shall make documented, good faith efforts to: 1. Contact previous employers to obtain information or recommendations that may be relevant to a person's fitness to work in a residential care institution, nursing care institution or home health agency. 2. Verify the current status of a person's fingerprint clearance card.",
            "evidence": "Based on record review and interview, the owner failed to ensure compliance with Arizona Revised Statutes A.R.S. § 36-411(C)(1) for one of five personnel records sampled. The deficient practice posed a safety risk as the Department was unable to determine substantial compliance as the documentation was not in the personnel records during the inspection.",
            "findings": "A.R.S. § 36-411(C) states: \"C. Owners shall make documented, good faith efforts to: 1. Contact previous employers to obtain information or recommendations that may be relevant to a person's fitness to work in a residential care institution, nursing care institution or home health agency.\" 1. A review of E5's personnel record revealed documentation of good faith efforts to contacts previous employers to obtain information or recommendation that may be relevant to a persons fitness to work in a residential care institution was not available for review. 2. In an exit interview, E1 reviewed the findings and no additional documentation was provided. Plan of Correction Name, title and/or Position of the Person Responsible Date temporary correction was implemented Date permanent correction will be complete Temporary Solution Permanent Solution Monitoring"
        },
        {
            "rule": "G. An administrator shall ensure that a personnel record is maintained for each personnel member, employee, volunteer, or student that includes: 3. Documentation of: d. The individual's license or certification, if the individual is required to be licensed or certified in this Article or policies and procedures;",
            "evidence": "Based on record review and interview, the administrator failed to ensure documentation of the individuals license or certification was maintained in a personnel record for one of five employees sampled. The deficient practice posed a risk if a personnel member was unable to meet a resident's needs at the facility.",
            "findings": "1. A review of E2's personnel record revealed documentation of a professional license was not available for review. 2. In an interview, E1 and E2 reported E2 has a license but could not find the documentation. 3. In an exit interview, E1 and E2 reviewed the findings and no additional documentation was provided. Plan of Correction Name, title and/or Position of the Person Responsible Date temporary correction was implemented Date permanent correction will be complete Temporary Solution Permanent Solution Monitoring"
        },
        {
            "rule": "R9-10-113. Tuberculosis Screening A. If a health care institution is subject to the requirements of this Section, as specified in an Article in this Chapter, the health care institution's chief administrative officer shall ensure that the health care institution establishes, documents, and implements tuberculosis infection control activities that: 2. Include: a. For each individual who is employed by the health care institution, provides volunteer services for the health care institution, or is admitted to the health care institution and who is subject to the requirements of this Section, baseline screening, on or before the date specified in the applicable Article of this Chapter, that consists of: i. Assessing risks of prior exposure to infectious tuberculosis, ii. Determining if the individual has signs or symptoms of tuberculosis, and iii. Obtaining documentation of the individual's freedom from infectious tuberculosis according to subsection (B)(1);",
            "evidence": "Based on record review and interview, the chief administrative officer failed to implement tuberculosis (TB) infection control activities including baseline screening consisting of assessing risks of prior exposure to infectious TB, determining if the individual had signs or symptoms of TB, and the individual's freedom from infectious TB. The deficient practice posed a potential TB exposure risk to residents.",
            "findings": "R9-10-113.B.1.c.(i- ii) B. A health care institution's chief administrative officer shall: 1. For an individual for whom baseline screening and documentation of freedom from infectious tuberculosis is required by an Article in this Chapter, as specified in subsection (A)(2)(a), obtain one of the following as evidence of freedom from infectious tuberculosis: c. If the individual had a positive Mantoux skin test or other tuberculosis screening test according to subsection (B)(1)(a) and does not have history of tuberculosis or documentation of latent tuberculosis infection, as defined in A.A.C. R9- 6-1201, a written statement: i. ii. That the individual is free from infectious tuberculosis, signed by a medical practitioner or local health agency, as defined in A.A.C. R9-6-101; and Dated within 12 months before the date the individual begins providing services at or on behalf of the health care institution or is admitted to the health care institution. 1. A review of E5's (hired September 2024) personnel record revealed a negative TB test dated January 24, 2023. However, documentation of evidence of freedom from infectious TB, as required in R9-10-113, and baseline screening consisting of assessing risks of prior exposure to infectious TB and determining if the individual had signs or symptoms of TB was not available for review. 2. In an interview, E1 reported E5 had the documentation but could not find the correct TB tests. 3. In an interview, E1 reviewed the findings and no additional documentation was provided. Plan of Correction Name, title and/or Position of the Person Responsible Date temporary correction was implemented Date permanent correction will be complete Temporary Solution Permanent Solution Monitoring"
        }
    ]
}